Revit 2024 API
BuiltInFailures.SketchFailures.ManyDirectionCurvesError Property
 More than one direction curve specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ManyDirectionCurvesError { get; }
Visual Basic
Public Shared ReadOnly Property ManyDirectionCurvesError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ManyDirectionCurvesError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace